In [2]:
import pandas as pd
import numpy as np

In [3]:
data_one = {'a':['a0','a1','a2','a3'],'b':['b0','b1','b2','b3']}

In [4]:
data_two = {'c':['c0','c1','c2','c3'],'d':['d0','d1','d2','d3']}

In [5]:
data_one

{'a': ['a0', 'a1', 'a2', 'a3'], 'b': ['b0', 'b1', 'b2', 'b3']}

In [6]:
one  = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [7]:
one

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

In [8]:
two

    c   d
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [9]:
pd.concat([one,two],axis=1)

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [10]:
two.columns = one.columns

In [11]:
two

    a   b
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [12]:
mydf = pd.concat([one,two],axis = 0)
mydf.index = range(len(mydf))
mydf

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3
4  c0  d0
5  c1  d1
6  c2  d2
7  c3  d3

In [13]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [14]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [16]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [25]:
pd.merge(registrations,logins,how='outer',on= 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [26]:
pd.merge(registrations,logins,how='left',on= 'name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [28]:
pd.merge(registrations,logins,how='inner',on= 'name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [32]:
pd.merge(left= registrations,right = logins,how='right',on= 'name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [33]:
registrations = registrations.set_index('name')

In [35]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [36]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [43]:
pd.merge(registrations,logins,left_index=True,right_on='name',how = 'outer')

     reg_id  log_id     name
1.0     1.0     2.0   Andrew
3.0     2.0     4.0     Bobo
NaN     3.0     NaN   Claire
NaN     4.0     NaN    David
0.0     NaN     1.0   Xavier
2.0     NaN     3.0  Yolanda

In [44]:
registrations = registrations.reset_index()

In [45]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [48]:
registrations.columns = ['reg_name','reg_id']

In [49]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [55]:
r = pd.merge(registrations,logins,how = 'inner',left_on= 'reg_name', right_on= 'name')

In [61]:
r.drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [62]:
registrations.columns = ['name','id']

In [63]:
logins.columns = ['id','name']

In [64]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [65]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [67]:
pd.merge(registrations,logins,on = 'name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

In [68]:
pd.merge(registrations,logins,on = 'name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4